[
  {
    "version": "1.11.0",
    "items": [
      {
        "type": "new",
        "title": "Daten Synchronisierung",
        "text": "GridScore kann jetzt Daten von verschiedenen Geräten im gleichen Versuch synchronisieren. Daten werden priorisiert nach dem neuesten Änderungsdatum."
      },
      {
        "type": "new",
        "title": "Germinate-Export",
        "text": "Beim Exportieren von Daten in Germinate Datenvorlagen die Mehrfachmerkmale enthalten muss eine Aggregierungsmethode pro Merkmal gewählt werden."
      },
      {
        "type": "new",
        "title": "Studien",
        "text": "GridScore unterstützt jetzt einen weiteren Typen an Datensatz: Studien. Diese sind für die freie Sammlung von Daten geeignet die sich nicht an eine Rasteranordnung halten."
      },
      {
        "type": "new",
        "title": "Datensatzkommentare",
        "text": "Es ist jetzt möglich allgemeine Kommentare zum gesamten Versuch hinzuzufügen. Dazu wird das kleine Kommentar-Symbol neben dem Versuchsnamen auf dem Datenbildschirm genutzt."
      },
      {
        "type": "update",
        "title": "Datenkreise",
        "text": "Die Merkmalskreise für Mehrfachmerkmale zeigen nun einen half-gefüllten Kreis wenn ein Mehrfachmerkmal mindestens einmal bewertet wurde."
      },
      {
        "type": "bugfix",
        "title": "Sprachsynthese",
        "text": "Behebt einen Fehler bei der Sprachsynthese wo in bestimmten Fällen Text verloren geht."
      }
    ]
  }, {
    "version": "1.12.0",
    "items": [
      {
        "type": "new",
        "title": "Einzel-Merkmal Wertedarstellung",
        "text": "GridScore kann jetzt die Werte für ein einzelnes Merkmal für alle Pflanzen/Beete direkt in der Datenansicht anzeigen. Um dies zu nutzen, klicke auf 'Merkmalssichtbarkeit' und dann auf 'Einzelner Wert'. Jetzt kann zwischen einzelnen Merkmalen gewechselt werden um deren Werte direkt im Feldplan anzuzeigen."
      },
      {
        "type": "update",
        "title": "Besseres Scannen von QR-Codes/Barcodes",
        "text": "Wir haben Programmbibliotheken für das Scannen von QR-Codes/Barcodes gewechselt. Die neue Bibliothek unterstützt mehrere Typen an Codes und sollte auch schneller beim Scannen sein als die alte Bibliothek."
      },
      {
        "type": "new",
        "title": "Mehrere Einträge zu einer Studie hinzufügen",
        "text": "Es ist jetzt möglich mehrere Einträge auf einmal zu einer Studie hinzuzufügen statt dies einzeln zu tun."
      },
      {
        "type": "bugfix",
        "title": "Fehlerbehebung beim Sammeln von Mehrfachmarkmalsdaten",
        "text": "In vorherigen Versionen war ein Fehler enthalten der auftrat wenn ein Mehrfachmerkmal bewertet wurde während gleichzeitig andere Merkmale ausgeblendet waren. Dies resultierte in korrupten Daten, wurde aber hiermit behoben."
      }
    ]
  }
]