[
  {
    "version": "1.11.0",
    "items": [
      {
        "type": "new",
        "title": "Data synchronization",
        "text": "GridScore is now able to synchronize data collected on different devices for the same trial. Data will be joined by prioritizing data with a newer recording date."
      },
      {
        "type": "new",
        "title": "Germinate export",
        "text": "When exporting data containing multi-traits to Germinate Data Templates, an aggregation method has to be chosen per trait."
      },
      {
        "type": "new",
        "title": "Surveys",
        "text": "GridScore now supports another type of dataset, namely Surveys. These are designed to support free data collection which is not physically located in a grid-like fashion."
      },
      {
        "type": "new",
        "title": "Dataset comments",
        "text": "It's now possible to add general comments to the whole trial. Use the wee comment icon next to the trial name on the data screen."
      },
      {
        "type": "update",
        "title": "Data circles",
        "text": "Trait data circles for multi-traits now show a half-filled circle when the trait has been scored at least once."
      },
      {
        "type": "bugfix",
        "title": "Speech synthesis",
        "text": "Fixed a bug with the speech synthesis which would sometimes cause text to be skipped."
      }
    ]
  }, {
    "version": "1.12.0",
    "items": [
      {
        "type": "new",
        "title": "Single trait value display",
        "text": "GridScore can now show you the value of a single trait for all plants/plots right in the data view. To try this out, select the 'Trait visibility' dropdown menu and then select 'Single value'. You are then able to switch between individual traits to see their values right in the field plan."
      },
      {
        "type": "update",
        "title": "Better QR-code/barcode scanning",
        "text": "We switched to a new library for QR-code/barcode scanning. This new library has better support for a variety of barcodes and should also scan codes quicker than the old library."
      },
      {
        "type": "new",
        "title": "Adding multiple entries to a survey",
        "text": "You'll now be able to add multiple entries to a survey at the same time rather than adding them individually."
      },
      {
        "type": "bugfix",
        "title": "Bug fix for multi-trait scoring",
        "text": "In previous versions there was a bug that happened when scoring multi-traits while also having some traits toggled. This would result in corrupted data and has now been corrected."
      }
    ]
  }
]